In [1]:
import numpy as np
import pandas as pd

In [3]:
sozlukVeri = {"istanbul":[30,29,np.nan],"giresun":[28,np.nan,28],"ankara":[np.nan,26,27]}
havaDurumuDataFrame = pd.DataFrame(sozlukVeri)

In [4]:
havaDurumuDataFrame

   istanbul  giresun  ankara
0      30.0     28.0     NaN
1      29.0      NaN    26.0
2       NaN     28.0    27.0

In [5]:
havaDurumuDataFrame.dropna()

Empty DataFrame
Columns: [istanbul, giresun, ankara]
Index: []

In [6]:
havaDurumuDataFrame

   istanbul  giresun  ankara
0      30.0     28.0     NaN
1      29.0      NaN    26.0
2       NaN     28.0    27.0

In [7]:
havaDurumuDataFrame.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [14]:
yeniVeri = {"istanbul":[30,29,np.nan],"giresun":[np.nan,np.nan,28],"ankara":[np.nan,26,27],"adana":[np.nan,45,np.nan]}
havaDurumuDataFrame2 = pd.DataFrame(yeniVeri)

In [15]:
havaDurumuDataFrame2

   istanbul  giresun  ankara  adana
0      30.0      NaN     NaN    NaN
1      29.0      NaN    26.0   45.0
2       NaN     28.0    27.0    NaN

In [17]:
havaDurumuDataFrame2.dropna(axis=1,thresh=2)

   istanbul  ankara
0      30.0     NaN
1      29.0    26.0
2       NaN    27.0

In [18]:
havaDurumuDataFrame2.fillna(20)

   istanbul  giresun  ankara  adana
0      30.0     20.0    20.0   20.0
1      29.0     20.0    26.0   45.0
2      20.0     28.0    27.0   20.0

In [19]:
havaDurumuDataFrame2

   istanbul  giresun  ankara  adana
0      30.0      NaN     NaN    NaN
1      29.0      NaN    26.0   45.0
2       NaN     28.0    27.0    NaN

## groupby

In [26]:
maasSozlugu = {"departman":["yazılım","yazılım","pazarlama","pazarlama","pazarlama","hukuk"],
              "çalışanlar":["ahmet","mehmet","atil","burak","zeynep","fatma"],
               "maaş":[100,150,200,300,400,500]
              }

In [27]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [28]:
maasDataFrame

   departman çalışanlar  maaş
0    yazılım      ahmet   100
1    yazılım     mehmet   150
2  pazarlama       atil   200
3  pazarlama      burak   300
4  pazarlama     zeynep   400
5      hukuk      fatma   500

In [30]:
grup = maasDataFrame.groupby("departman")

In [31]:
grup.count()

           çalışanlar  maaş
departman
hukuk               1     1
pazarlama           3     3
yazılım             2     2

In [32]:
grup.mean()

            maaş
departman
hukuk      500.0
pazarlama  300.0
yazılım    125.0

In [34]:
grup.min()

          çalışanlar  maaş
departman
hukuk          fatma   500
pazarlama       atil   200
yazılım        ahmet   100

In [35]:
grup.max()

          çalışanlar  maaş
departman
hukuk          fatma   500
pazarlama     zeynep   400
yazılım       mehmet   150

In [37]:
grup.describe()

           maaş
          count   mean         std    min    25%    50%    75%    max
departman
hukuk       1.0  500.0         NaN  500.0  500.0  500.0  500.0  500.0
pazarlama   3.0  300.0  100.000000  200.0  250.0  300.0  350.0  400.0
yazılım     2.0  125.0   35.355339  100.0  112.5  125.0  137.5  150.0